using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using TMPro;

public class MBTILuck : MonoBehaviour
{
    string[] luck =
    {
        "웃는 얼굴이 복을 부른다. 새로운 희망이 생기니 힘이 샘솟는 것 같겠다.",
        "신경을 곤두세우지 말고 평소대로 냉정하게 움직여라",
        "무관심에서 서로를 챙겨주는 사이로 발전하게 된다.",
        "기회는 언제나 있는 것이 아니다. 이 기회를 놓치지 마라.",
        "상대에게 미묘한 감정과 호기심을 느끼게 되는 날이다.",
        "사랑과 집착을 구별하라. 상대를 피곤하게 할 수 있다.",
        "즐겁고 행복한 생활을 즐기려면 적극적인 대화가 중요하다.",
        "쓸모없는 감정이나 자존심 때문에 아까운 시간을 낭비하지 마라.",
        "상쾌하게 마무리되고 유쾌한 시간을 갖을 듯하다.",
        "작은 일에 얽매이지 마라. 넓게 이해하는 마음이 필요하다.",
        "의심으로 마음이 흔들리고 있다. 무척이나 혼란스러울 것이다.",
        "자신의 생각이 옳다고 믿고 생각한 데로 하면 된다.",
        "가족간의 친목을 도모하라. 화기애애한 분위기를 만들 것.",
        "중요한 갈림길에 서게 될 것이니 신중하게 판단하라.",
        "자신의 진면목을 충분히 보여주게 되고 인정도 받는다.",
        "계급장을 다 떼고 한판 붙어 보았으면 하는 마음이 강해진다.",
        "침묵이 금이다. 말수를 줄이고 조용히 지나가는 것이 현명하다.",
        "늘 같은 모습은 보기 좋지않다. 변화가 필요한 시점이다.",
        "부정은 부정을 부르고 긍정은 긍정을 부르니 상대의 단점보다 장점을 찾으라.",
        "내 마음속으로 새로운 사람이 들어온다. 큰 힘이 되어주는 일도 있겠다.",
        "위험한 지름길보다는 멀지만 안전한 길을 선택하라.",
        "가만히 있어도 복이 저절로 굴러 들어오는 행운의 날이다.",
        "어떤 의혹이나 오해를 받지 않도록 투명하게 오픈해야 한다.",
        "좋은게 좋은것이라 생각하고 시원하게 넘어가라.",
        "돈을 쓸 때에는 그만한 가치가 있는 곳에 써라.",
        "더 이상 망설이지 마라. 용기를 내서 한 걸음 다가가야 한다.",
        "눈에 차지 않는 사람은 딱 잘라서 거절하라. 잘못된 인연을 만나서 한동안 고생할 수 있다.",
        "오늘 하루만이라도 내 마음이 가는대로 따라가라.",
        "심신의 상태가 최상이다. 일도 잘 풀릴 것이다.",
        "눈치 없는 사람으로 보이지 않으려면 상황파악을 잘해야 할 것이다.",
        "큰 이익만 욕심내면 작은 이익도 날리니 침착해라.",
        "오랫동안 노력해야 발전이 있다.",
        "오늘 하루 불리하게 진행되니 지혜를 발휘해야한다.",
        "교만하게 행동하지 말고 원만이 처신하면 성사된다.",
        "추진하는 일을 재점검하여 끝을 맺어라.",
        "분별없이 행동하면 꼭 손해 보는 일이 생긴다.",
        "고집불통의 행동은 손실만 부른다.",
        "장애물을 적극 돌파하면 결국 해결된다.",
        "욕심을 삼가고 분수에 맞는 행동을 하여라.",
        "가능하다고 판단되면 내일을 위해 투자하라.",
        "힘들고 바쁘게 일해도 인정 못 받는다.",
        "주변이 혼란스러워도 강한 의지로 해결하라.",
        "무리하게 앞서 나가지 말고 수양에 힘써라.",
        "방자해 있으니 말조심하며 추진하라.",
        "기회를 엿보다 놓칠 수 있으니 서둘러라.",
        "궁색하게 절약 말고 품위 유지해라.",
        "외형으로 사람을 판단하지 마라. 더 좋은 사람이다.",
        "고집 부리지 말고 대세에 순응하라.",
        "너무 앞만 보고 전진하면 혼란이 가중되니 힐링의 시간이 필요하다.",
        "뜻대로 되지 않아 재물적인 곤란이 생기니 지출 관리를 하라.",
        "추진하는 일이 더디게 진행되니 조급한 마음을 갖지말고 침착하라",
        "돌발적인 사고가 발생 할 수 있으니 모든 일에 조금 거리를 두어라.",
        "전전긍긍 하지말고 문제에서 한발 뒤로 물러서서 잠시 관찰하고 점검해보아라.",
        "준비와 점검에 시간을 갖고 차분하게 진행하라. 욕심보단 안전이 우선이다.",
        "오늘 하루는 겸손한 자세로 사람들을 대해주면 좋은 기회와 행운을 얻게 된다.",
        "새로운 일을 펼치지 말고 내부에 주력하면 많은 계기가 만들어 질 것이다.",
        "경쟁에서 유리하지만 질투, 함정도 있으니 사람 관계에서 지나친 언행을 피해라.",
        "시행착오 때문에 손해를 보는것 같아도 결국에는 좋은 방향으로 흘러가게 된다.",
        "결과도 빠르고 주목받고 인기도 생기지만 한 순간의 방심으로 손실도 생기니 주의하라.",
        "혼자 두드러지면 안된다. 속도를 줄이고 다른 사람들과 호흡을 같이 하라.",
        "성급한 행동으로 후회할 일을 만들지 마라. 입에 쓴 약 처럼 주위의 조언을 들어라.",
        "철저한 계획과 주변사람들의 의견을 잘 수렴 하라. 생각 못한 함정이 기다리고 있다.",
        "직업적인 면에서 조금씩 어려움이 따르니 과욕보다는 안정을 추구하라.",
        "전전긍긍 하지말고 문제에서 한발 뒤로 물러서서 잠시 관찰하고 점검해보아라.",
        "오늘은 내 마음대로 해도 좋은 하루다. 오늘 하루를 즐기길 바란다.",
        "주위를 둘러보고 힘들어하는 친구와 함께 놀기 좋은 날이다.",
        "오늘 하루는 가족들과 함께 시간을 보내면 행복을 찾을 수 있다.",
        "나를 지지해주는 사람이 생기니 주위에서 손을 내밀면 꼭 붙잡도록 하라.",
        "불안해서 자꾸 의심을 하게 되는 하루다.",
        "집안에 좋은 소식이 있을 예정. 축하할 준비를 하면 좋은 하루이다.",
        "입방아에 오르내리기 쉬운 날이니 행실을 바르게 하라.",
        "나의 생각과 능력을 보여주기 좋은 하루이다. 자신감을 가져라.",
        "자신의 매력을 어필하기 좋은 하루이다. 매력을 뽐내고 있는 상대가 있다면 보여주라.",
        "금전이나 거래에 유리한 하루이다. 추진하는 바가 있으면 앞으로 나아가라.",
        "감언이설에 속아 충동적 구매는 금물이다.",
        "일찍 귀가하여 자기 자신을 지키라.",
        "주변과 서로 신뢰를 쌓으라.",
        "뻔히 알면서도 빼앗기니 서글픈 하루이다.",
        "어려움 중에 소중한 것을 얻을 것이다.",
        "자신의 맡은 일에 최선을 다하는 전문가가 되어라.",
        "지금하지 못하면 진행을 못 할 수 있으니 강력히 추진하라.",
        "소극적인 태도를 버리고 모든일에 대하여 항상 적극적인 태도와 자신감으로 부딪혀야 성과가 있다.",
        "행운이 크게 따르는 날이다. 노력하면 그 이상을 얻게 될 것이며 무모한 도전으로 좋은 운을 허비하지 않도록 해야한다.",
        "상대를 험담하기전에 자신의 잘못부터 뉘우쳐라.",
        "주위의 도움으로 돌파구를 찾는다.",
        "나중을 위해 자신의 일에 전념하라.",
        "심술을 부려 일을 망친다.",
        "상대의 장점을 내 것으로 만들라.",
        "거짓된 언행은 상대방에게 실망감만 안긴다.",
        "자신을 단련할 수 있는 좋은 기회다.",
        "언행의 일치를 가지고 행동하라.",
        "타인의 일에 지나친 간섭은 좋지 않다.",
        "수완과 인맥이 좋은이 어려운 일이 해결된다.",
        "사람들과 빈번한 왕래를 가져라.",
        "지출이 많은 날이니 주변을 멀리하라."

    };
    [SerializeField]
    TMP_Text text;

    System.Random ran;
    void Start()
    {
        ran = new System.Random();
    }

    void Update()
    {

    }

    public void Luck()
    {
        int num = ran.Next(luck.Length);
        text.text = luck[num];
    }
}